/* Да се разработи програма, която изисква от потребителя да въведе
целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента.
Да се намери сумата от всички числа в интервала [0; 1000)
делящи се на x и да се запише като първа стойност в масива.
Да се намери сумата от всички числа в интервала [0;1000)
деляща се на 2x и да се запише като втора стойност в масива.
Аналогично да се намери сумата на всички числа делящи се на
Nx за N в интервала [1;10] и да се запишат като елемент N-1
в масива. Масивът да се изведе на стандартния изход.
*/

#include <iostream>

using namespace std;

int main() {
    int x;
    while ( (x < 1) || (x > 9) ) {
        cout << "Enter X ( 0 < x < 10 ): ";
        cin >> x;
    }

    int arr[10];

    int sum = 0, i = 0, v = 0;

    for (v = 1; v < 11; v++) {
        sum = 0;
        for (i = 0; i < 1000; i++){
            if ((i%(v*x)) == 0) {sum += i;}
        }
        arr[v] = sum;
    }

    for (i = 1; i < 11; i++) {
        cout << "ARRAY for "<< i <<" : " << arr[i] << endl;
    }
    return 0;
}
